C2CRIBuildDir/projects/C2C-RI/src/TMDDv303/src/InfoLayer/Data/TCS-5-dlEventIndexSubscription-OC-InValid-4.data

 
#<!--   
#       Title:  TCS-5-dlEventIndexSubscription-OC-InValid-4
#       Description:  This test case is used to verify the SUTs support of the dlEventIndexSubscription dialog as an OC using the variable values specified by the Test Plan.   This test case supports verification of requirements related to user need 2.3.3.1 [Need For An Index of Events]. This Test Case tests for an invalid response result. An error response message is expected be returned with an error-code set to 4 (message is not well formed or cannot be parsed).
#       Related Procedure:  TPS-5-dlEventIndexSubscription-OC
#       Version/Date: 2014/01/16 01:59:50
#-->

#ITERATION NAME = One
#GROUP NAME = General
#PARAMETER TYPE = Boolean
#EDITABLE = true
#DOCUMENTATION = This variable represents whether the Test Case is expected to pass.  Valid values are True or False.
CheckOutcomePassed = true

#PARAMETER TYPE = String
#EDITABLE = false
#DOCUMENTATION = This variable contains a set of element values that are expected in the message to be verified.
VerificationSpec = #VALUESPEC#Values#VALUESPEC#

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable identifies the Application Layer Standard that will be used for this test.  NTCIP2306v01 is the only valid value at this time.
ApplicationLayerStandard = NTCIP2306v01

#PARAMETER TYPE = LongInteger
#EDITABLE = true
#DOCUMENTATION = This variable indicates the number of publication message transmissions the test application is expected to receive as part of this test.  Valid values are 1 to 4,294,967,295.
PublicationsToReceive = 0

#PARAMETER TYPE = Boolean
#EDITABLE = false
#DOCUMENTATION = This variable indicates whether a Publication update error response is expected from the SUT.  Valid values are True or False.
PublicationErrorResponseExpected = True

#PARAMETER TYPE = String
#EDITABLE = false
#DOCUMENTATION = This variable indicates the type of Publication update error is expected from the SUT.
PublicationErrorTypeExpected = 4

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable represents the Publication Response Message to be sent to the SUT.
PublicationResponseMessage = #MESSAGESPEC#PubResponseMessage#MESSAGESPEC#

#PARAMETER TYPE = Boolean
#EDITABLE = true
#DOCUMENTATION = This flag defines whether the Test Application will test for Authentication.  Valid values are True or False.
AuthenticationCheck = False

#PARAMETER TYPE = Boolean
#EDITABLE = true
#DOCUMENTATION = This variable indicates whether the EC has the privilege to receive the information requested.  Valid values are True or False.
AllowAccess = True

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable represents the Subscription Message to be sent to the SUT.  The variable value is set to a string that is not valid XML.
SubscriptionMessage = <soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header/><soapenv:Body><c2c:c2cMessageSubscription xmlns:c2c="http://www.ntcip.org/c2c-message-administration"><informationalText>string</informationalText><returnAddress>http://C2CRIEC:8086/TMDDWS/EC/tmddECSoapHttpService/tmddECSoapHttpServicePort/dlEventIndexUpdate</returnAddress><subscriptionAction><subscriptionAction-item>newSubscription</subscriptionAction-item></subscriptionAction><subscriptionType><subscriptionType-item>periodic</subscriptionType-item></subscriptionType><subscriptionID>string</subscriptionID><subscriptionName>string</subscriptionName><subscriptionTimeFrame><start>2013-06-18T19:18:33</start><end>2014-08-19T13:27:14-04:00</end></subscriptionTimeFrame><subscriptionFrequency>7</subscriptionFrequency><broadcastAlerts><broadcastAlert>broadcastAlertsAccepted</broadcastAlert></broadcastAlerts></c2c:c2cMessageSubscription><mes:eventRequestMsg xmlns:mes="http://www.tmdd.org/303/messages"><authentication><user-id>string</user-id><password>string</password><operator-id>string</operator-id></authentication><request-header><organization-information><organization-id>agency.com</organization-id><organization-name>string</organization-name><organization-location>stringstri</organization-location><organization-function>string</organization-function><organization-contact-details><contact-id>string</contact-id><person-name>string</person-name><person-title>string</person-title><phone-number>string</phone-number><phone-alternate>string</phone-alternate><mobile-phone-number>string</mobile-phone-number><mobile-phone-id>string</mobile-phone-id><fax-number>string</fax-number><pager-number>string</pager-number><pager-id>string</pager-id><email-address>string</email-address><radio-unit>string</radio-unit><address-line1>string</address-line1><address-line2>string</address-line2><city>string</city><state>st</state><zip-code>string</zip-code><country>string</country></organization-contact-details><center-contact-list><center-contact-details><center-id>agency_test</center-id><center-name>string</center-name><center-location xmlns:lrms="http://www.LRMS-Adopted-02-00-00"><latitude>33964380</latitude><longitude>-84217945</longitude><horizontalDatum>3</horizontalDatum><height><verticalLevel>2</verticalLevel></height></center-location><center-description>string</center-description><center-type>2</center-type><center-contact-details><contact-id>string</contact-id><person-name>string</person-name><person-title>string</person-title><phone-number>string</phone-number><phone-alternate>string</phone-alternate><mobile-phone-number>string</mobile-phone-number><mobile-phone-id>string</mobile-phone-id><fax-number>string</fax-number><pager-number>string</pager-number><pager-id>string</pager-id><email-address>string</email-address><radio-unit>string</radio-unit><address-line1>string</address-line1><address-line2>string</address-line2><city>string</city><state>st</state><zip-code>string</zip-code><country>string</country></center-contact-details></center-contact-details></center-contact-list><last-update-time><date>20130531</date><time>105805</time><offset>01:00</offset></last-update-time></organization-information><organization-requesting><organizations-requested-item><organization-id>agency.com</organization-id><organization-name>string</organization-name><organization-location>stringstri</organization-location><organization-function>string</organization-function><organization-contact-details><contact-id>string</contact-id><person-name>string</person-name><person-title>string</person-title><phone-number>string</phone-number><phone-alternate>string</phone-alternate><mobile-phone-number>string</mobile-phone-number><mobile-phone-id>string</mobile-phone-id><fax-number>string</fax-number><pager-number>string</pager-number><pager-id>string</pager-id><email-address>string</email-address><radio-unit>string</radio-unit><address-line1>string</address-line1><address-line2>string</address-line2><city>string</city><state>st</state><zip-code>string</zip-code><country>string</country></organization-contact-details><center-contact-list><center-contact-details><center-id>agency_test</center-id><center-name>string</center-name><center-location xmlns:lrms="http://www.LRMS-Adopted-02-00-00"><latitude>33964380</latitude><longitude>-84217945</longitude><horizontalDatum>nad83</horizontalDatum><height><verticalLevel>2</verticalLevel></height></center-location><center-description>string</center-description><center-type>mobile</center-type><center-contact-details><contact-id>string</contact-id><person-name>string</person-name><person-title>string</person-title><phone-number>string</phone-number><phone-alternate>string</phone-alternate><mobile-phone-number>string</mobile-phone-number><mobile-phone-id>string</mobile-phone-id><fax-number>string</fax-number><pager-number>string</pager-number><pager-id>string</pager-id><email-address>string</email-address><radio-unit>string</radio-unit><address-line1>string</address-line1><address-line2>string</address-line2><city>string</city><state>st</state><zip-code>string</zip-code><country>string</country></center-contact-details></center-contact-details></center-contact-list><last-update-time><date>20130531</date><time>105805</time><offset>01:00</offset></last-update-time></organizations-requested-item></organization-requesting><message-type-id>6</message-type-id><message-type-version>6</message-type-version><message-number>7</message-number><message-time-stamp><date>stringst</date><time>string</time><offset>strin</offset></message-time-stamp></request-header><request-type><request-focus>6</request-focus><event-ids><event-id>string</event-id></event-ids><response-plan-ids><response-plan-id>string</response-plan-id></response-plan-ids></request-type><request-filters><request-filter><category>3</category><priority-level>6</priority-level><confidence-level>unconfirmed report</confidence-level><access-level>5</access-level><action-request-flag>2</action-request-flag><severity>5</severity><hazmat-code><hazmat-code-item>7</hazmat-code-item></hazmat-code><placard-code><placard-code-item>7</placard-code-item></placard-code><organizations-requested><organizations-requested-item><organization-id>agency.com</organization-id><organization-name>string</organization-name><organization-location>stringstri</organization-location><organization-function>string</organization-function><organization-contact-details><contact-id>string</contact-id><person-name>string</person-name><person-title>string</person-title><phone-number>string</phone-number><phone-alternate>string</phone-alternate><mobile-phone-number>string</mobile-phone-number><mobile-phone-id>string</mobile-phone-id><fax-number>string</fax-number><pager-number>string</pager-number><pager-id>string</pager-id><email-address>string</email-address><radio-unit>string</radio-unit><address-line1>string</address-line1><address-line2>string</address-line2><city>string</city><state>st</state><zip-code>string</zip-code><country>string</country></organization-contact-details><center-contact-list><center-contact-details><center-id>agency_test</center-id><center-name>string</center-name><center-location xmlns:lrms="http://www.LRMS-Adopted-02-00-00"><latitude>33964380</latitude><longitude>-84217945</longitude><horizontalDatum>nad27</horizontalDatum><height><altitude><ft>3</ft></altitude><verticalDatum>navd</verticalDatum></height></center-location><center-description>string</center-description><center-type>fixed</center-type><center-contact-details><contact-id>string</contact-id><person-name>string</person-name><person-title>string</person-title><phone-number>string</phone-number><phone-alternate>string</phone-alternate><mobile-phone-number>string</mobile-phone-number><mobile-phone-id>string</mobile-phone-id><fax-number>string</fax-number><pager-number>string</pager-number><pager-id>string</pager-id><email-address>string</email-address><radio-unit>string</radio-unit><address-line1>string</address-line1><address-line2>string</address-line2><city>string</city><state>st</state><zip-code>string</zip-code><country>string</country></center-contact-details></center-contact-details></center-contact-list><last-update-time><date>20130531</date><time>105805</time><offset>01:00</offset></last-update-time></organizations-requested-item></organizations-requested><headline><roadwork>insert-local-values-here</roadwork></headline></request-filter></request-filters><request-locations><request-location><link-designator><link-designator-item>string</link-designator-item></link-designator></request-location></request-locations><request-times><start-time><date>stringst</date><time>string</time><offset>strin</offset></start-time><end-time><date>stringst</date><time>string</time><offset>strin</offset></end-time></request-times><mes:eventRequestMsg></soapenv:Body></soapenv:Envelope>

#PARAMETER TYPE = Boolean
#EDITABLE = false
#DOCUMENTATION = This variable indicates whether a subscription error response is expected from the SUT.  Valid values are True or False.
SubscriptionErrorResponseExpected = True

#PARAMETER TYPE = String
#EDITABLE = false
#DOCUMENTATION = This variable indicates the type of subscription error response that is expected from the SUT.
SubscriptionErrorTypeExpected = 4


#GROUP NAME = Values

